src/Catalogs/Commands.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Commands</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.DocumentJournals</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.FilterCriteria</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.Configurations</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Deleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommandGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CommandGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommandParameterType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Types</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Config</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiesData</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParameterUseMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CommandParameterUseMode</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Picture</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CommonPictures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Representation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ButtonRepresentation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Shortcut</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ModuleKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ModuleKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CommandModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CommonModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FormModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTTPServiceModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ManagerModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ObjectModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RecordSetModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ValueManagerModule</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebServiceModule</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Modules.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Modules</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.CommonModules</xr:Item>
				<xr:Item>Catalog.Constants</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.Projects</xr:Item>
				<xr:Item>Catalog.Commands</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.DocumentJournals</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.FilterCriteria</xr:Item>
				<xr:Item>Catalog.Sequences</xr:Item>
				<xr:Item>Catalog.SettingsStorages</xr:Item>
				<xr:Item>Catalog.HTTPServices</xr:Item>
				<xr:Item>Catalog.WebServices</xr:Item>
				<xr:Item>Catalog.CommonCommands</xr:Item>
				<xr:Item>Catalog.Forms</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Config</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ModuleKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Path</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Deleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Commands/Ext/ManagerModule.bsl
Function Load(Context, Data) Export
	Var Object, CacheItem;
	
	Config = Context.Config;
	Owner  = Context.Owner;
	Cache  = Context.Cache;
	Path   = Context.Path;
	
	// precondition:
	// # (Config == Owner.Owner)
	// # Path is folder path
	
	This = Catalogs.Commands;
	MetaName = "Command";
	
	Properties = Data.Properties;
	UUID = Data.UUID;
	
	CacheItem = Meta.CacheItem(Cache, MetaName, New Structure("UUID", UUID));  
	
	CacheItem.Owner = Owner;	
	CacheItem.Name = Properties.Name;
	
	BeginTransaction();
	
	Object = Meta.GetObject(This, CacheItem);
	
	// Cached fields  
		
	FillPropertyValues(Object, CacheItem, CachedFields());
	
	// Properties
	
	Object.Config = Config;
	
	Abc.Fill(Object, Properties, Abc.Lines(
		"Comment"
		"Representation"
		"ParameterUseMode"
		"ModifiesData"
	)); 
	
	Meta.UpdateStrings(Config, CacheItem.Ref, Object, Properties, Abc.Lines(
	    "Synonym"
		"ToolTip"
	));
	
	Object.Write();
	
	ChildContext = Meta.LoadContext(Config, CacheItem.Ref, Cache, Abc.JoinPath(Path, "Commands\" + Properties.Name));
	
	// Module
	
	CommandModule = Catalogs.Modules.Load(
		ChildContext,
		Enums.ModuleKinds.CommandModule
	);	
	
	CommitTransaction();
	
	Return CacheItem.Ref;
	
EndFunction // Load()
  
Function CachedFields() Export
	
	Return "UUID, Name, Owner";
	
EndFunction // CachedFields() 

Function Cache(Config) Export
	
	Query = New Query;
	Query.SetParameter("Config", Config);
	Query.Text = StrTemplate(
		"SELECT Ref, %1
		|FROM Catalog.Commands
		|WHERE Config = &Config AND NOT Deleted",
		CachedFields()
	);
	
	Table = Query.Execute().Unload();
	
	Table.Columns.Add("Mark", New TypeDescription("Boolean"));
	
	Table.Indexes.Add("UUID");
	
	Return Table;
	
EndFunction // Cache()
